In [1]:
import pandas as pd
import numpy as np
import pyodbc

# DATA

In [2]:
server = 'DESKTOP-LKUO5BT\SQLEXPRESS' 
database = 'DB_Oltp' 
username = 'DESKTOP-LKUO5BT\Glenvin k' 
password = ' '

In [3]:
df = pd.read_csv('Data.csv', sep = ',')
df.head()

,Purchasing Document,Item,Document Date,Year,Short Text,Categori,Order Quantity,Net price,Net Order Value,Order Unit,Lokasi
0,9100427506,1,12/30/2020,2020,Baja IWF 200 x 100 x 5.5 x 8mm - 6m,Baja IWF,4.0,"1,787,500","7,150,000",BTG,Sampit
1,9100427506,2,12/30/2020,2020,Plate bordes 6mm x 4' x 8',Plate,1.0,"2,169,500","2,169,500",LBR,Sampit
2,9100427506,3,12/30/2020,2020,Plate strip 4 x 38 x 6000mm,Plate,5.0,"130,000","650,000",BTG,Sampit
3,9100427506,4,12/30/2020,2020,"Pipa galvanish 2"" x 6m class Medium BS",Pipa,2.0,"607,000","1,214,000",BTG,Sampit
4,9100427506,5,12/30/2020,2020,Plate mild steel 6mm x 5' x 20',Plate,2.0,"5,322,000","10,644,000",LBR,Sampit

In [4]:
df = df [['Purchasing Document','Document Date','Short Text', 'Categori', 'Order Quantity', 'Net price', 'Order Unit', 'Lokasi']]

In [5]:
df.columns = df.columns.str.replace(' ', '_')
df.head()

,Purchasing_Document,Document_Date,Short_Text,Categori,Order_Quantity,Net_price,Order_Unit,Lokasi
0,9100427506,12/30/2020,Baja IWF 200 x 100 x 5.5 x 8mm - 6m,Baja IWF,4.0,"1,787,500",BTG,Sampit
1,9100427506,12/30/2020,Plate bordes 6mm x 4' x 8',Plate,1.0,"2,169,500",LBR,Sampit
2,9100427506,12/30/2020,Plate strip 4 x 38 x 6000mm,Plate,5.0,"130,000",BTG,Sampit
3,9100427506,12/30/2020,"Pipa galvanish 2"" x 6m class Medium BS",Pipa,2.0,"607,000",BTG,Sampit
4,9100427506,12/30/2020,Plate mild steel 6mm x 5' x 20',Plate,2.0,"5,322,000",LBR,Sampit

# CATEGORI

In [6]:
c_Oltp = pyodbc.connect("Driver={SQL Server};"
            "Server=DESKTOP-LKUO5BT\SQLEXPRESS;"
            "Database=DB_Oltp;"
            "Trusted_Connection=yes;")
cursor = c_Oltp.cursor()

In [7]:
Categori = pd.DataFrame(np.sort(df['Categori'].unique()), columns=['Categori'])
Categori['Categori_ID'] = range(1, 1 + len(Categori))
Categori = Categori.reindex(columns=['Categori_ID', 'Categori'])

In [8]:
Categori.head()

   Categori_ID           Categori
0            1              Angle
1            2           Baja IWF
2            3         Baut & Mur
3            4  Baut & Mur + Ring
4            5               Besi

In [9]:
for index, row in Categori.iterrows():
    cursor.execute("MERGE dbo.Categori as t1 USING (Values(?,?))\
                   AS t2(Categori_ID, Categori) ON t1.Categori_ID = t2.Categori_ID\
                   WHEN MATCHED THEN UPDATE SET t1.Categori_ID = t2.Categori_ID, t1.Categori = t2.Categori\
                   WHEN NOT MATCHED BY TARGET THEN INSERT (Categori_ID, Categori) VALUES (t2.Categori_ID, t2.Categori); ", row['Categori_ID'], row['Categori'])

In [10]:
c_Oltp.commit()
cursor.close()

# LOKASI

In [11]:
c_Oltp = pyodbc.connect("Driver={SQL Server};"
            "Server=DESKTOP-LKUO5BT\SQLEXPRESS;"
            "Database=DB_Oltp;"
            "Trusted_Connection=yes;")
cursor = c_Oltp.cursor()

In [12]:
Lokasi = pd.DataFrame(np.sort(df['Lokasi'].unique()), columns=['Lokasi'])
Lokasi['Lokasi_ID'] = range(1, 1 + len(Lokasi))
Lokasi = Lokasi.reindex(columns=['Lokasi_ID', 'Lokasi'])

In [13]:
Lokasi.head()

   Lokasi_ID       Lokasi
0          1       Bangka
1          2  Banjarmasin
2          3     Belitung
3          4        Jambi
4          5     Jayapura

In [14]:
for index, row in Lokasi.iterrows():
    cursor.execute("MERGE dbo.Lokasi as t1 USING (Values(?,?))\
                   AS t2(Lokasi_ID, Lokasi) ON t1.Lokasi_ID = t2.Lokasi_ID\
                   WHEN MATCHED THEN UPDATE SET t1.Lokasi_ID = t2.Lokasi_ID, t1.Lokasi = t2.Lokasi\
                   WHEN NOT MATCHED BY TARGET THEN INSERT (Lokasi_ID, Lokasi) VALUES (t2.Lokasi_ID, t2.Lokasi); ", row['Lokasi_ID'], row['Lokasi'])

In [15]:
c_Oltp.commit()
cursor.close()

# ORDER UNIT

In [16]:
c_Oltp = pyodbc.connect("Driver={SQL Server};"
            "Server=DESKTOP-LKUO5BT\SQLEXPRESS;"
            "Database=DB_Oltp;"
            "Trusted_Connection=yes;")
cursor = c_Oltp.cursor()

In [17]:
Order_Unit = pd.DataFrame(np.sort(df['Order_Unit'].unique()), columns=['Order_Unit'])
Order_Unit['OrderUnit_ID'] = range(1, 1 + len(Order_Unit))
Order_Unit = Order_Unit.reindex(columns=['OrderUnit_ID', 'Order_Unit'])

In [18]:
Order_Unit.head()

   OrderUnit_ID Order_Unit
0             1        BOX
1             2        BTG
2             3         EA
3             4         KG
4             5        LBR

In [19]:
for index, row in Order_Unit.iterrows():
    cursor.execute("MERGE dbo.OrderUnit as t1 USING (Values(?,?))\
                   AS t2(OrderUnit_ID, Order_Unit) ON t1.OrderUnit_ID = t2.OrderUnit_ID\
                   WHEN MATCHED THEN UPDATE SET t1.OrderUnit_ID = t2.OrderUnit_ID, t1.Order_Unit = t2.Order_Unit\
                   WHEN NOT MATCHED BY TARGET THEN INSERT (OrderUnit_ID, Order_Unit) VALUES (t2.OrderUnit_ID, t2.Order_Unit); ", row['OrderUnit_ID'], row['Order_Unit'])

In [20]:
c_Oltp.commit()
cursor.close()

# PEMBELIAN

In [6]:
c_Oltp = pyodbc.connect("Driver={SQL Server};"
            "Server=DESKTOP-LKUO5BT\SQLEXPRESS;"
            "Database=DB_Oltp;"
            "Trusted_Connection=yes;")
cursor = c_Oltp.cursor()

In [7]:
sqlQueryCategori = "SELECT * FROM dbo.Categori"
df_Categori = pd.read_sql(sql = sqlQueryCategori, con = c_Oltp)

sqlQueryLokasi = "SELECT * FROM dbo.Lokasi"
df_Lokasi = pd.read_sql(sql = sqlQueryLokasi, con = c_Oltp)

sqlQueryOrder_Unit = "SELECT * FROM dbo.OrderUnit"
df_Order_Unit = pd.read_sql(sql = sqlQueryOrder_Unit, con = c_Oltp)

In [8]:
Categori_merged = df.merge(df_Categori, left_on = 'Categori', right_on = 'Categori', how='left')
Lokasi_merged = Categori_merged.merge(df_Lokasi, left_on = 'Lokasi', right_on = 'Lokasi', how='left')
Order_Unit_merged = Lokasi_merged.merge(df_Order_Unit, left_on = 'Order_Unit', right_on = 'Order_Unit', how='left')

In [9]:
Pembelian = Order_Unit_merged[['Purchasing_Document', 'Document_Date', 'Short_Text', 'Order_Quantity', 'Net_price', 'Categori_id', 'Lokasi_id','OrderUnit_id']].rename(columns={'Document_Date': 'Tanggal_Document' , 'Short_Text' : 'Nama_Barang', 'Order_Quantity' : 'Jumlah_Pembelian', 'Net_price' : 'Harga'}).copy()
Pembelian[['Purchasing_Document_id']] = range(1, 1+len(Pembelian))
Pembelian = Pembelian.reindex(columns=['Purchasing_Document_id', 'Categori_id', 'Lokasi_id','OrderUnit_id','Purchasing_Document', 'Tanggal_Document', 'Nama_Barang', 'Jumlah_Pembelian', 'Harga'])

In [10]:
Pembelian.head()

,Purchasing_Document_id,Categori_id,Lokasi_id,OrderUnit_id,Purchasing_Document,Tanggal_Document,Nama_Barang,Jumlah_Pembelian,Harga
0,1,2,13,2,9100427506,12/30/2020,Baja IWF 200 x 100 x 5.5 x 8mm - 6m,4.0,"1,787,500"
1,2,42,13,5,9100427506,12/30/2020,Plate bordes 6mm x 4' x 8',1.0,"2,169,500"
2,3,42,13,2,9100427506,12/30/2020,Plate strip 4 x 38 x 6000mm,5.0,"130,000"
3,4,40,13,2,9100427506,12/30/2020,"Pipa galvanish 2"" x 6m class Medium BS",2.0,"607,000"
4,5,42,13,5,9100427506,12/30/2020,Plate mild steel 6mm x 5' x 20',2.0,"5,322,000"

In [11]:
for index, row in Pembelian.iterrows():
    cursor.execute("MERGE dbo.Pembelian as t1 USING (Values(?,?,?,?,?,?,?,?,?))\
                   AS t2(Purchasing_Document_id, Purchasing_Document, Tanggal_Document, Nama_Barang, Jumlah_Pembelian, Harga, Categori_id, Lokasi_id, OrderUnit_id) ON t1.Purchasing_Document_id = t2.Purchasing_Document_id\
                   WHEN MATCHED THEN UPDATE SET t1.Purchasing_Document_id = t2.Purchasing_Document_id, t1.Purchasing_Document = t2.Purchasing_Document, t1.Tanggal_Document = t2.Tanggal_Document, t1.Nama_Barang = t2.Nama_Barang, t1.Jumlah_Pembelian = t2.Jumlah_Pembelian, t1.Harga = t2.Harga, t1.Categori_id = t2.Categori_id, t1.Lokasi_id = t2.Lokasi_id, t1.OrderUnit_id = t2.OrderUnit_id\
                   WHEN NOT MATCHED BY TARGET THEN INSERT (Purchasing_Document_id, Purchasing_Document, Tanggal_Document, Nama_Barang, Jumlah_Pembelian, Harga, Categori_id, Lokasi_id, OrderUnit_id) VALUES (t2.Purchasing_Document_id, t2.Purchasing_Document, t2.Tanggal_Document, t2.Nama_Barang, t2.Jumlah_Pembelian, t2.Harga, t2.Categori_id, t2.Lokasi_id, t2.OrderUnit_id ); ", row['Purchasing_Document_id'], row['Purchasing_Document'], row['Tanggal_Document'], row['Nama_Barang'], row['Jumlah_Pembelian'], row['Harga'],row['Categori_id'], row['Lokasi_id'], row['OrderUnit_id'])

In [12]:
c_Oltp.commit()
cursor.close()